# Pandas

## Overview

- fundamental package for data analysis and manipulation
- fast, powerful, flexible and easy to use
- build upon NumPy

## Table of content
- (i) Creating, reading and writing
- (ii) Indexing, selection and assigning
- (iii) Summary functions and maps
- (iv) Grouping and sorting
- (v) Data types and missing values

### (i) Creating, reading and writing

In [1]:
import pandas as pd

There are two core objects in pandas: __DataFrames__ and __Series__

In [2]:
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

In [3]:
# Dictionary-list constructor
pd.DataFrame({'Yes': [50, 21], 'No': [131,2]})

   Yes   No
0   50  131
1   21    2

In [14]:
# other way
pd.DataFrame([[50,131], [21,2]], columns=['Yes', 'No'])

   Yes   No
0   50  131
1   21    2

In [9]:
# Set index
pd.DataFrame({'Yes': [50, 21], 'No': [131, 2]}, index=['Product A', 'Product B'])

           Yes   No
Product A   50  131
Product B   21    2

In [17]:
# other way
df = pd.DataFrame([[50,131], [21,2]], columns=['Yes', 'No'], index=['Product A', 'Product B'])
df

           Yes   No
Product A   50  131
Product B   21    2

In [18]:
# Useful functions
df.shape

(2, 2)

In [19]:
df.head()

           Yes   No
Product A   50  131
Product B   21    2

In [20]:
df.columns

Index(['Yes', 'No'], dtype='object')

In [ ]:
# Writing
df.to_csv("filename.csv")

---

__Series__ is a sequence of data values, basically a list

Does not have a column name, only an overall name

In [15]:
# list constructor
pd.Series([2,4,6])

0    2
1    4
2    6
dtype: int64

In [16]:
# Index
pd.Series([2, 4, 6], index=['a', 'b', 'c'], name='Table 1')

a    2
b    4
c    6
Name: Table 1, dtype: int64

In [ ]:
# Reading data files
pd.read_csv("...\location\file.csv")

In [ ]:
# Reading large data files in chunks (splits in multiple DataFrames with 5 rows each)
for df in pd.read_csv('xxx.csv', chunksize=5):
    pass()

### (ii) Indexing, selection and assigning

In [24]:
import numpy as np
reviews = pd.DataFrame({'country': ['Italy', 'Portugal', 'France', 'France'], 'description': ['aaa', 'bbbb', 'ccccc', 'dd'], 'points': [87, 87, 90, 90], 'price': [np.NaN, 15, 32,21]})
reviews

    country description  points  price
0     Italy         aaa      87    NaN
1  Portugal        bbbb      87   15.0
2    France       ccccc      90   32.0
3    France          dd      90   21.0

In [25]:
# Selecting Series out of a DataFrame
reviews.country

0       Italy
1    Portugal
2      France
3      France
Name: country, dtype: object

In [26]:
# other way
reviews['country']

0       Italy
1    Portugal
2      France
3      France
Name: country, dtype: object

In [27]:
reviews['country'][1]

'Portugal'

#### Indexing accessor operators
- iloc:  integer-location based indexing / selection by position
-  loc:  
 - 1) selecting rows by label/index
 - 2) selecting rows with a boolean/ conditional lookup

In [30]:
# iloc - row first, column second

# Select first row
reviews.iloc[0]

country        Italy
description      aaa
points            87
price            NaN
Name: 0, dtype: object

In [31]:
# Select first column
reviews.iloc[:, 0]

0       Italy
1    Portugal
2      France
3      France
Name: country, dtype: object

In [32]:
# The preferred way to obtain an entry in the DataFrame:
reviews.country.iloc[0]

'Italy'

In [33]:
# Get the first two entries from the first column
reviews.iloc[:2, 0]

0       Italy
1    Portugal
Name: country, dtype: object

In [34]:
# Other way
reviews.country.iloc[:2]

0       Italy
1    Portugal
Name: country, dtype: object

In [35]:
# Get the second and third entry
reviews.iloc[1:3, 0]

1    Portugal
2      France
Name: country, dtype: object

In [36]:
# Pass a list to obtain entries
reviews.iloc[[0, 1, 2], 0]

0       Italy
1    Portugal
2      France
Name: country, dtype: object

In [37]:
# Retrieve last two rows of dataset
reviews.iloc[-2:]

  country description  points  price
2  France       ccccc      90   32.0
3  France          dd      90   21.0

---

In [39]:
# loc - label-based selection - row first, column second

reviews.loc[0, 'country']

'Italy'

In [41]:
# Select multiple columns
reviews.loc[:, ['country', 'points']]

    country  points
0     Italy      87
1  Portugal      87
2    France      90
3    France      90

In [42]:
# Careful
reviews.iloc[0:2]

    country description  points  price
0     Italy         aaa      87    NaN
1  Portugal        bbbb      87   15.0

In [43]:
reviews.loc[0:2]

    country description  points  price
0     Italy         aaa      87    NaN
1  Portugal        bbbb      87   15.0
2    France       ccccc      90   32.0

#### Conditional selection

In [44]:
reviews.country == 'Italy'

0     True
1    False
2    False
3    False
Name: country, dtype: bool

In [46]:
# One condition
reviews.loc[reviews.country == 'France']

  country description  points  price
2  France       ccccc      90   32.0
3  France          dd      90   21.0

In [47]:
# Multiple conditions
reviews.loc[(reviews.country == 'France') & (reviews.price < 30)]

  country description  points  price
3  France          dd      90   21.0

In [48]:
# Isin function
reviews.loc[reviews.country.isin(['Italy', 'France'])]

  country description  points  price
0   Italy         aaa      87    NaN
2  France       ccccc      90   32.0
3  France          dd      90   21.0

In [49]:
# Notnull function
reviews.loc[reviews.price.notnull()]

    country description  points  price
1  Portugal        bbbb      87   15.0
2    France       ccccc      90   32.0
3    France          dd      90   21.0

In [50]:
# Isnull function
reviews.loc[reviews.price.isnull()]

  country description  points  price
0   Italy         aaa      87    NaN

In [53]:
# Assigning data 
reviews['critic'] = 'everyone'
reviews

    country description  points  price    critic
0     Italy         aaa      87    NaN  everyone
1  Portugal        bbbb      87   15.0  everyone
2    France       ccccc      90   32.0  everyone
3    France          dd      90   21.0  everyone

## (iii) Summary functions and maps

#### Summary functions

In [58]:
# Describe function for numerical values
reviews.points.describe()

count     4.000000
mean     88.500000
std       1.732051
min      87.000000
25%      87.000000
50%      88.500000
75%      90.000000
max      90.000000
Name: points, dtype: float64

In [59]:
# Describe function for categorical values
reviews.country.describe()

count          4
unique         3
top       France
freq           2
Name: country, dtype: object

In [60]:
# Mean
reviews.points.mean()

88.5

In [63]:
# Unique function
reviews.country.unique()

array(['Italy', 'Portugal', 'France'], dtype=object)

In [64]:
# Value : Counts
reviews.country.value_counts()

France      2
Portugal    1
Italy       1
Name: country, dtype: int64

#### Maps
Map is a term for a function that takes one set of values and _maps_ them to another set of values.

There are two mapping methods, _map()_ is the first one

In [65]:
review_points_mean = reviews.points.mean()
review_points_mean

88.5

In [68]:
# remean the scores to 0 (does not happen inplace)
r2 = reviews.points.map(lambda p: p-review_points_mean)
r2

0   -1.5
1   -1.5
2    1.5
3    1.5
Name: points, dtype: float64



_Apply_ is the equivalent method if we wanbt to transform a whole DataFrame by calling a custom method on each row

In [69]:
def remean_points(row):
    row.points = row.points - review_points_mean
    return row
reviews.apply(remean_points, axis='columns')

    country description  points  price    critic
0     Italy         aaa    -1.5    NaN  everyone
1  Portugal        bbbb    -1.5   15.0  everyone
2    France       ccccc     1.5   32.0  everyone
3    France          dd     1.5   21.0  everyone

Passing axis='index' would instead transform each column

map() and apply() return new, transformed Series and DataFrames, they don't modify the original data

In [70]:
reviews

    country description  points  price    critic
0     Italy         aaa      87    NaN  everyone
1  Portugal        bbbb      87   15.0  everyone
2    France       ccccc      90   32.0  everyone
3    France          dd      90   21.0  everyone

---

In [71]:
# Comining columns
reviews.country + " - " + reviews.description

0        Italy - aaa
1    Portugal - bbbb
2     France - ccccc
3        France - dd
dtype: object

## (iv) Grouping and sorting

In [72]:
# Groupwise analysis:

# Replicate value_counts() function

reviews.groupby('points').points.count()

points
87    2
90    2
Name: points, dtype: int64

In [73]:
reviews.groupby('points').size()

points
87    2
90    2
dtype: int64

In [74]:
# agg lets you run a bunch of different functions on your DataFrame simultaneously
reviews.groupby('country').price.agg([min, max])

           min   max
country
France    21.0  32.0
Italy      NaN   NaN
Portugal  15.0  15.0

In [75]:
# Sorting

reviews.sort_values(by='price', ascending=False)

    country description  points  price    critic
2    France       ccccc      90   32.0  everyone
3    France          dd      90   21.0  everyone
1  Portugal        bbbb      87   15.0  everyone
0     Italy         aaa      87    NaN  everyone

In [77]:
reviews.sort_values(by=['country', 'price'])

    country description  points  price    critic
3    France          dd      90   21.0  everyone
2    France       ccccc      90   32.0  everyone
0     Italy         aaa      87    NaN  everyone
1  Portugal        bbbb      87   15.0  everyone

## (v) Data types and missing values

Dtypes - the data type for a column in a DataFrame or Series is known as the dtype

In [78]:
reviews.price.dtype

dtype('float64')

In [81]:
# Convertion from one type into another
reviews.points.astype('int32')

0    87
1    87
2    90
3    90
Name: points, dtype: int32

#### Missing data

for technical reasons always of dtype _float64_

In [82]:
# isnull() - select NaN entries
# notnull() - select all values except NaN
reviews[pd.notnull(reviews.price)]

    country description  points  price    critic
1  Portugal        bbbb      87   15.0  everyone
2    France       ccccc      90   32.0  everyone
3    France          dd      90   21.0  everyone

In [83]:
# fillna() - replacing missing data
reviews.price.fillna(100)

0    100.0
1     15.0
2     32.0
3     21.0
Name: price, dtype: float64

In [85]:
# replace()
reviews.replace("aaa", "cool gadget")

    country  description  points  price    critic
0     Italy  cool gadget      87    NaN  everyone
1  Portugal         bbbb      87   15.0  everyone
2    France        ccccc      90   32.0  everyone
3    France           dd      90   21.0  everyone